Documents/Requests/GetProductAvailability_VFDEGet_02_02_2022_10_55_15_Request.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <Action xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none" s:mustUnderstand="1">SubsidizedHandsetValidation</Action>
  </s:Header>
  <s:Body>
    <ns0:GetProductAvailabilityRequest xmlns:ns0="http://amdocs/vfde/product/VFDEGetProductAvailability" xmlns:ns2="http://amdocs/vfde/product/VFDEGetProductAvailabilityInput" xmlns:ns3="http://amdocs/vfde/product/VFDEGetProductAvailabilityOutput" xmlns:ns1="http://amdocs/vfde/common/VFDECommonTypes">
      <ns2:ROOT>
        <Event>
          <Type>GetProductAvailability</Type>
          <ID>37992519602b9aca1db9d0.02630815</ID>
          <CallerID>OSF</CallerID>
          <CorrelationID>9b61rk9vgq4srd239d8lu3fri1</CorrelationID>
          <FrontendUserId>4311</FrontendUserId>
          <SalesChannel>telesales</SalesChannel>
        </Event>
        <DATA>
          <KDAddressID>3070775</KDAddressID>
          <Portal>OFT</Portal>
          <PostCode>13587</PostCode>
          <City>Berlin</City>
          <District> </District>
          <Street>Sigmund-Bergmann-Str.</Street>
          <HouseNumber>16</HouseNumber>
          <HouseNumberAddition> </HouseNumberAddition>
        </DATA>
      </ns2:ROOT>
    </ns0:GetProductAvailabilityRequest>
  </s:Body>
</s:Envelope>